In [4]:
import pandas as pd 
Player_one =  pd.DataFrame({
     "scores" : [ 22, 24,25,26] ,
     "player" : ['sachin' , 'rahul' , 'danish' , 'subash']
    }) 
Player_one

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash

In [5]:
Player_two =  pd.DataFrame({
     "scores" : [ 21, 29,34,56] ,
     "player" : ['mannu' , 'motu' , 'chotu' , 'majid']
    }) 
Player_two

   scores player
0      21  mannu
1      29   motu
2      34  chotu
3      56  majid

In [6]:
concat = pd.concat([Player_one , Player_two])
concat

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash
0      21   mannu
1      29    motu
2      34   chotu
3      56   majid

In [31]:
df = pd.concat([Player_one , Player_two] , keys = [ "India" , "Nepal"] )
df

         scores  player
India 0      22  sachin
      1      24   rahul
      2      25  danish
      3      26  subash
Nepal 0      21   mannu
      1      29    motu
      2      34   chotu
      3      56   majid

In [18]:
df.loc["India"]

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash

In [19]:
df.loc["Nepal"]

   scores player
0      21  mannu
1      29   motu
2      34  chotu
3      56  majid

In [20]:
Player_one_df =  pd.DataFrame({
     "scores" : [ 22, 24,25,26] ,
     "player" : ['sachin' , 'rahul' , 'danish' , 'subash']
    }, index[0,1,2,3]) 
Player_one_df

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash

In [27]:
Player_two_df =  pd.DataFrame({
     "scores" : [ 21, 29,34,56] ,
     "player" : ['mannu' , 'motu' , 'chotu' , 'majid']
    } , index=[0,1,2,3]) 
Player_two_df

   scores player
0      21  mannu
1      29   motu
2      34  chotu
3      56  majid

In [29]:
df = pd.concat([Player_one_df , Player_two_df] , ignore_index=True)
df

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash
4      21   mannu
5      29    motu
6      34   chotu
7      56   majid

In [32]:
# merge 
Player_one =  pd.DataFrame({
     "scores" : [ 22, 24,25,26] ,
     "player" : ['sachin' , 'rahul' , 'danish' , 'subash']
    }) 
Player_one

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash

In [46]:
Player_two =  pd.DataFrame({
     "scores" : [ 22, 29,34,56] ,
     "player" : ['sachin' , 'motu' , 'chotu' , 'majid']
    }) 
Player_two

   scores  player
0      22  sachin
1      29    motu
2      34   chotu
3      56   majid

In [38]:
df = pd.merge( Player_one , Player_two , on ="scores") # ( on) find to common link between two value
df

   scores player_x player_y
0      22   sachin    mannu

In [39]:
df = pd.merge( Player_one , Player_two , how = "left")
df

   scores  player
0      22  sachin
1      24   rahul
2      25  danish
3      26  subash

In [40]:
df = pd.merge( Player_one , Player_two , how = "right")
df

   scores player
0      22  mannu
1      29   motu
2      34  chotu
3      56  majid

In [41]:
df = pd.merge( Player_one , Player_two , how = "outer")
df

   scores  player
0      22   mannu
1      22  sachin
2      24   rahul
3      25  danish
4      26  subash
5      29    motu
6      34   chotu
7      56   majid

In [45]:
df = pd.merge( Player_one , Player_two , on="player" )
df

Empty DataFrame
Columns: [scores_x, player, scores_y]
Index: []